Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: བྱི་རུ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་དང་། མུ་ཏིག་དམར་པོས་ལེགས་པར་བརྒྱན་པར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་ཁམས་དེ་མིག་མངས་རིས་སུ་བྱས་པ།
en: The world will be separated into square plots like a chessboard.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ། ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བ།
en: It will be as flat as the palm of one’s hand and pleasant to touch like the down of the kācalindika bird.

source: དར་གྱི་ལྡ་ལྡི་མང་པོ་བྲེས་པ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བས་ལེགས་པར་བརྒྱན་པ།
en: It will be adorned with raised flags, victory banners, and parasols fringed with bunches of silken tassels.

source: ལྷའི་མེ་ཏོག་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་གིས་ཁེབས་པར་བྱས་པ། སྤོས་ཀྱི་སྙིང་པོ་དམ་པས་བདུགས་པ།
en: It will be covered with divine blossoms and jeweled flowers.

source: སྟེང་གི་བར་སྣང་ལ་ལྷའི་རོལ་མོའི་སྒྲ་ལེན་པ་ཅན་དུ་འགྱུར་རོ། །
en: The air will be filled with the smell of the finest incense, and the sky above it will resound with divine music.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ངན་སོང་དང་། མི་ཁོམ་པ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །
en: This world will be devoid of all the bad realms of rebirth and the unfavorable circumstances for practicing the Dharma.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དགའ་ལྡན་གྱི་ལྷའི་ཡོངས་སུ་སྤྱོད་པ་དང་འདྲ་བ་དང་ཡིད་ལ་བསམ་པས་ཟས་དང་སྐོམ་དང་། སྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་དང་། གོས་དང་། རྒྱན་གྲུབ་ཅིང་ལེགས་པར་བརྒྱན་པར་འགྱུར་རོ། །
en: This world will be adorned with dwellings, floating palaces, and parks as though they were ornaments, and there will be food and drink to the heart’s content, just like the enjoyments of the gods in the Heaven of the Contented.

source: ལྷ་དང་མི་ཐམས་ཅད་ཀྱང་ཁང་པ་བརྩེགས་པ་ལ་མཚུངས་པར་ཡོངས་སུ་སྤྱོད་པར་འགྱུར་རོ། །ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱ་ཆེན་པོ་ལ་མོས་པར་འགྱུར་ཏེ།
en: “Even though the enjoyments there in the pavilions with their high peaks will be earthly and divine enjoyments, all the gods and human beings there will have their interest piqued by what is lofty;

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མོས་པ་ཤ་སྟག་གོ། །
en: that is, they will take a keen interest in the knowledge of the buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡང་རུང་སྟེ། ཐེག་པ་གཉིས་ཀྱི་མིང་ཡང་མི་གྲག་པར་འགྱུར་རོ། །
en: In that world, the names of the two other vehicles—that is, the Vehicle of the Disciples and the Vehicle of the Solitary Buddhas—will not even exist.

source: བཅོམ་ལྡན་འདས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཏམ་འབའ་ཞིག་གསུང་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ནི་འབུམ་ཕྲག་མང་པོར་འགྱུར་རོ། །
en: There, the realized one Vajravikrāmin will be surrounded by an assembly of many hundreds of thousands of bodhisattvas, and that blessed one will give the bodhisattvas teachings that are completely unadulterated.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་སེམས་ཅན་གང་ཡང་ཆོ་ག་ཉམས་པའམ། འཚོ་བ་ཉམས་པའམ། ཚུལ་ཁྲིམས་ཉམས་པའམ། ལྟ་བ་ཉམས་པར་མི་འགྱུར་རོ། །ཞར་བའམ། འཐེང་པོའམ། སྒུར་པོའམ། གཏུམ་པོའམ། དིག་པའམ།
en: “Furthermore, the beings in that world will not see their customs degenerate, their livelihoods will not become corrupted, their moral conduct will not decline, and neither will their views degenerate.

source: མི་སྲུན་པའམ། ཀླ་ཀློ་ཅན་ནམ། ལྐུགས་པའམ། གྲུམ་པོའམ། དབང་པོ་མ་ཚང་བར་མི་འགྱུར་རོ། །
en: The beings there will not be blind, crippled, hunchbacked, tongue-tied, mute, or lame, and neither will they have any impaired faculties.

source: ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་ཀྱང་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱིས་བརྒྱན་པར་འགྱུར་རོ། །
en: All the gods and humans will be adorned with twenty-eight of the marks of a great person.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བརྒྱད་ཐུབ་པར་འགྱུར་རོ། །
en: There, the length of that realized one’s life will span eight intermediate eons.

source: ལྷ་དང་མི་རྣམས་ཀྱང་གློ་བུར་དུ་འཆི་བར་མི་འགྱུར་རོ། །
en: The gods and humans will not die before their time is ripe.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེའི་ཡོན་ཏན་ཚད་མེད་པའི་རྒྱུའི་ཁྱད་པར་ནི་འདི་དག་དང་གཞན་ཡང་མང་དུ་ཡོད་དོ། །
en: Indeed, Śāntamati, these are just some of the immeasurable number of special conditions and qualities of the realized one Vajravikrāmin; there are many others, too.

source: དེ་བཞིན་གཤེགས་པ་དེ་ནམ་ཆོས་སྟོན་པར་འགྱུར་བ་དེའི་ཚེ་སྐུ་ལས་འོད་ཕྱུང་བ་དང་།
en: “Additionally, when that realized one teaches the Dharma, he will give off light from his body.

source: དེ་ནས་སེམས་ཅན་དེ་དག་གིས་འོད་དེ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་པར་འགྱུར་ཏེ་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པར་འགྱུར་གྱིས། བདག་ཅག་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་དུ་འདོང་ངོ་སྙམ་མོ། །དེ་ན་ཁ་ཅིག་ནི་མངོན་པར་ཤེས་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འོང་བར་འགྱུར།
en: Now, when those beings see this light, they will think, ‘The Realized One is starting to give a teaching of the Dharma, so we should go to the Blessed One to listen to the Dharma.’ Some will arrive through the power of their own superhuman abilities and supernormal faculties.

source: ཁ་ཅིག་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འོང་བར་འགྱུར་རོ། །དེར་ལྷ་དང་མི་དེ་དག་འདུས་པ་དང་།
en: Some will arrive by means of the empowering authority of that realized one, who will then rise into the sky above the gods and human beings who have gathered there to a height of one hundred thousand palm trees.

source: དེ་བཞིན་གཤེགས་པ་དེ་སྟེང་གི་བར་སྣང་ལ་ཤིང་ཏ་ལ་འབུམ་སྲིད་དུ་མངོན་པར་འཕགས་ཏེ་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་ནས་སྐུས་ཁྱབ་པར་མཛད་དེ།
en: While hovering there in a cross-legged position, he will pervade that world of four great continents with his body.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པ་ཚིམ་པར་བྱ་བའི་ཕྱིར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་ཀྱིས་གོ་བར་མཛད་དེ། དེ་བཞིན་གཤེགས་པའི་གསུང་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཆོས་སྟོན་པར་འགྱུར་རོ། །
en: He will then teach the Dharma to those bodhisattvas using the speech a realized one, which satisfies all beings according to their own thoughts and motivations, and with the voice and tone of a buddha, which can be understood throughout an immeasurable number of worlds in the ten directions.

source: དེའི་ནང་ན་གང་དེ་བཞིན་གཤེགས་པའི་ཆོས་སྟོན་པ་དང་འགལ་བར་བྱེད་པའམ། ཟློག་པར་བྱེད་པའི་སེམས་ཅན་ནི་གཅིག་ཀྱང་མེད་དོ། །
en: Moreover, not even a single being among them will go against or offer resistance to the Dharma taught by that realized one.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་དབང་པོ་རྣོ་བ། མགོ་སྨོས་པས་གོ་བར་འགྱུར་བ་ཤ་སྟག་གོ། །
en: Each and every one of those beings will have sharp faculties and the ability to understand highly condensed statements.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེ་མ་གཏོགས་པར་རྒྱལ་པོ་གཞན་གང་ཡང་མེད་པར་འགྱུར་རོ། །
en: In that world, there will be no king other than the true king of the Dharma, the realized one Vajravikrāmin.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནང་ཡི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པར་འགྱུར་རོ། །
en: In that world, there will not be any possession or sense of ownership, either.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ང་ཡི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེ་ལྷའི་བུའམ།
en: All those beings will be without possessions or a sense of ownership.

source: མིར་གྱུར་པ་གང་ལ་བསོད་སྙོམས་བླང་བར་བཞེད་པར་གྱུར་པའི་ལྷའི་བུའམ། མིར་གྱུར་པ་དེའི་མདུན་དུ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ལྷུང་བཟེད་ཐོགས་པ་ཉེ་བར་གནས་པ་དང་།
en: “Moreover, Śāntamati, the form of the realized one Vajravikrāmin will appear in front of any gods or human-like beings who wish to make an offering of alms, and he will be holding his alms bowl so that they may do so.

source: དེར་ལྷའི་བུའམ། མིར་གྱུར་པ་དེས་དེ་བཞིན་གཤེགས་པའི་གཟུགས་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་བདག་ལས་བཤོས་གསོལ་བར་བཞེད་དོ་སྙམ་ནས་ཡིད་ཀྱིས་བསམས་པས་འཁོར་གྱི་ཁྱམས་སུ་སྟན་དང་། ཟས་དང་། སྐོམ་དང་།
en: When any gods or human-like beings see that realized one’s form, they will think, ‘The blessed realized one Vajravikrāmin wishes to enjoy a meal in my presence.’ Then, with their minds they will create a circular space with seats and places to lie down, and food and drink, and they will tell that blessed one that it is time for the midday meal.

source: རོ་བརྒྱ་པའི་ཟས་སྦྱར་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་གདུགས་ཚོད་ལ་བབ་ཅེས་གསོལ་པ་དང་། དེར་དེ་བཞིན་གཤེགས་པ་དེ་བཤོས་གསོལ་ལོ། །བཤོས་གསོལ་ནས་སླར་བཞུད་པར་འགྱུར་རོ། །
en: Then, that realized one will enjoy the meal, and after enjoying it, he will depart.

source: དེ་བཞིན་གཤེགས་པ་དེ་གང་གི་ཚེ། ནང་དུ་ཡང་དག་འཇོག་ལ་འཇུག་པར་འགྱུར་བ་དེ་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཏིང་ངེ་འཛིན་གྱི་བཀོད་པས་གནས་པར་འགྱུར་རོ། །
en: When that realized one goes into seclusion, the bodhisattvas there will dwell in an array of states of meditative concentration.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་ཡོན་ཏན་གྱི་རྒྱུའི་ཁྱད་པར་འདི་དག་དང་། གཞན་ཡང་ཚད་མེད་པ་དག་དང་ལྡན་པར་འགྱུར་ཏེ།
en: That world will possess these special conditions and qualities and an immeasurable number of others.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཀུན་ནས་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ། །
en: Therefore, noble son, that world is called Samantapariśuddhā.”

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་ལུང་བསྟན་པ་བཤད་པ་འདི་བསྟན་པ་ན་སྲོག་ཆགས་ཉི་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། །
en: Furthermore, while the description of the prediction for Vajrapāṇi, Lord of the Guhyakas, was being was being elucidated, twenty thousand beings conceived the aspiration for unsurpassable and perfect awakening.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ཤོག་ཤིག་ཅེས་སྨོན་ལམ་ཡང་བཏབ་བོ། །དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཡོངས་སུ་དག་པ་དེར་སྐྱེ་བར་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་ཏོ། །
en: They made the vow, “I will be reborn in that buddha domain!” The Blessed One then made the prediction that all of them would be reborn there in Samantapariśuddhā, the buddha domain of the blessed realized one Vajravikrāmin.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རང་གི་ལུང་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Now, after Vajrapāṇi, Lord of the Guhyakas, heard the prediction given for him, he was satisfied, overjoyed, pleased, and glad.

source: རྡོ་རྗེ་དེ་ནམ་མཁའི་དཀྱིལ་དུ་འཕངས་སོ། །
en: He felt both delight and cheerfulness of mind, and he threw his vajra up into the vault of the sky.

source: རྡོ་རྗེ་དེ་འཕངས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །མེ་ཏོག་གི་ཆར་ཡང་བབ་བོ། །
en: Right when he threw the vajra, at that precise moment, this cosmos of a billion worlds quaked in the six ways, and it rained a shower of flowers.

source: རོལ་མོ་སིལ་སྙན་བརྒྱའི་སྒྲ་ཡང་བྱུང་ངོ་། །
en: It resounded with the sounds of hundreds of musical instruments.

source: འཁོར་ཐམས་ཅད་ཀྱི་ལག་པ་གཡས་པར་ཡང་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་དག་བྱུང་ངོ་། །
en: Garlands of flowers of various colors spontaneously manifested in the right hands of everyone in the assembly.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Vajrapāṇi, Lord of the Guhyakas, then praised the Blessed One with these verses:

source: ཆོས་ཀྱི་དབང་ཕྱུག་རྒྱ་ཆེན་མི་ཟད་ཆོས་ཀྱི་མཛོད། །
en: “Lord of Dharma, you are an abundant and inexhaustible treasury of the true Dharma.

source: ཆོས་རྣམས་རབ་ཏུ་འབྱེད་ལ་མཁས་པ་འགྲོ་དོན་བཞེད། །
en: You are skilled in the fine analysis of things everywhere for the benefit of the world.

source: ཆོས་ལ་ཐུགས་མ་ཞུམ་ཞིང་རྟག་ཏུ་ལྷུག་པར་བཏང་། །
en: Your heart is unwearied toward things; your detachment and surrender are firm.

source: ཆོས་ཀྱི་རྗེས་འཐུན་ཆོས་སྒྲུབ་གནས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you who are fixed upon the practice of such true forms of the Dharma.

source: སེམས་ཅན་དག་པ་ཁྱོད་ཀྱི་ཡེ་ཤེས་སྤྱོད་རྣམ་དག །
en: “For your knowledge and your purified conduct, O Pure Being,

source: ཡོན་ཏན་རྒྱལ་གྲགས་སྙན་པ་འཇིག་རྟེན་གསུམ་དུ་གྲགས། །
en: Full of virtue like a king, your glory known far and wide through the three worlds,

source: ཡེ་ཤེས་རྒྱུན་ནི་དུས་གསུམ་རྟག་ཏུ་བས་མ་འཚལ། །
en: An inexhaustible stream of knowledge, now and forever through the three times,

source: ཆགས་འདས་ཞབས་མཉམ་ལེགས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I offer salutations to you whose level now is equal to the surpassing of attachment.

source: ཟླ་བ་ལས་ལྷག་ཡོངས་དག་ཚུལ་ཁྲིམས་རྣམ་པར་དག །
en: “The total purity of your pureness surpasses the pure luster of the moon.

source: ཉི་མ་ལས་ལྷག་འོད་མཛེས་འོད་མངའ་གཟི་བརྗིད་མཆོག །
en: The supreme splendor of your fine radiance surpasses the radiance of the sun.

source: ཚངས་པ་ལས་ལྷག་གསུང་སྙན་ཚངས་པའི་གསུང་མངའ་བ། །
en: The holy tones of your fine voice surpass the intonations of a brahmā.

source: དཀོན་མཆོག་གསུམ་ལྡན་གསེར་འདྲ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, your radiance that of gold, foremost even among the Three Jewels.

source: ཁྱོད་ནི་སྐུ་ཡང་སྟོན་ལ་སྐུ་དང་ལྡན་མ་ལགས། །
en: “You display a body, but you are not at all bound to a body.

source: ཁྱོད་ནི་གསུང་ཡང་རྗོད་ལ་སྒྲ་སྐད་རྟོག་མི་མངའ། །
en: You speak with a voice, but concepts have no hold over you.

source: ཁྱོད་ནི་ཆོས་ཀྱང་གསུང་ལ་ཆོས་ཀྱི་འདུ་ཤེས་བྲལ། །
en: You proclaim the Dharma, but you have no fixed notion of a dharma.

source: སེམས་ཅན་ཐར་བར་མཛད་ལ་སེམས་ཅན་འདུ་ཤེས་བྲལ།
en: You cause the liberation of beings, but you have no idea of a being.

source: གང་དག་ཁྱོད་བསྟན་ཐོས་ནས་ཇི་ལྟར་བསྟན་པ་ལྟར། །བསྒྲུབ་པ་སྙིང་པོར་གནས་པ་དག་ནི་མ་གཏོགས་པར།
en: “At no point whatsoever would it be possible to repay you,

source: འགྲོ་བ་ཐམས་ཅད་རྟག་ཏུ་རབ་ཏུ་བྱུང་ཡང་ནི། །
en: Not even by all the beings of the world freed from the troubles of the home,

source: ཁྱོད་ཀྱི་བཀའ་དྲིན་ལན་ལོན་ནམ་ཡང་རྔོ་མི་ཐོག །
en: Except insofar as those beings understand what you have taught,

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ཇི་ལྟར་ཐོགས་ཐོགས་པའི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་ཕྲེང་བ་རྣམས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །
en: Dwell in the core of the practices, and are trained thereby in the truth.” At that point, Vajrapāṇi, Lord of the Guhyakas, and all the members of the assembly who had been holding various jeweled garlands of flowers in their hands, completely covered the Blessed One with them.

source: མེ་ཏོག་གི་ཕྲེང་བ་དེ་དག་གཏོར་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་ལེགས་པར་བརྒྱན་པར་གྱུར་ཅིང་མིག་མངས་རིས་སུ་གནས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: Right when those garlands of flowers were strewn at him, at that precise moment, this cosmos of a billion worlds became completely adorned with garlands of various flowers, and it also appeared as though it were separated into square plots like a chessboard. This was accomplished through the wondrous power of the Buddha.

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལུང་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་དྲུག་པའོ།། །།
en: This was the sixteenth chapter, “The Prediction for Vajrapāṇi, Lord of the Guhyakas.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས།
en: Chapter 17: Articulating Nonduality

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གསང་བ་པའི་བདག་པོ་ཁྱོད་དེ་བཞིན་གཤེགས་པས་ལུང་བསྟན་མོད།
en: At that point, the bodhisattva Śāntamati said this to Vajrapāṇi, Lord of the Guhyakas: “The Realized One has made a prediction for you, Lord of the Guhyakas.”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་རྨི་ལམ་གྱི་རང་བཞིན་ལྟ་བུའི་ལུང་བསྟན་པས་བདག་ལུང་བསྟན་ཏོ། །
en: Vajrapāṇi responded, “The prediction made for me, noble son, is one that has the nature of a dream.”

source: སྨྲས་པ། ཅི་ཞིག་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལུང་བསྟན།
en: “What have you been predicted to obtain?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཐོབ་པར་བྱ་བ་མེད་པར་ལུང་བསྟན་པ་ཐོབ་བོ། །
en: “The prediction I have obtained, noble son, is for what does not obtain.”

source: སྨྲས་པ་ཅི་ཞིག་ཐོབ་པ་མེད། སྨྲས་པ།
en: “What does not obtain?

source: སེམས་ཅན་དང་། སྲོག་དང་། གང་ཟག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་ཐོབ་པ་མེད་དོ། །
en: “A being, a life force, a person, an individual entity, and a human being—these do not obtain.

source: ཕུང་པོ་རྣམས་དང་། ཁམས་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་ཐོབ་པ་མེད་དོ། །དགེ་བ་དང་། མི་དགེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་།
en: The aggregates, elements, and sense spheres do not obtain.

source: ཟག་པ་མེད་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་།
en: It is the same with virtue, vice, purity, impurity, the defiled, the undefiled, the mundane, the transcendent, the conditioned, the unconditioned, the afflicted, the cleansed, saṃsāra, and nirvāṇa—these do not obtain.”

source: འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བར་དུ་ཐོབ་པ་མེད་དོ། །སྨྲས་པ། གལ་ཏེ་ཐོབ་པ་མེད་ན་འདིར་ཅི་ཞིག་ལུང་སྟོན། སྨྲས་པ།
en: “If they do not obtain, then what was predicted here?”

source: མི་དམིགས་པ་གང་ཡིན་པ་དེའི་རྗེས་སུ་འགྲོ་བའི་ཡེ་ཤེས་ལུང་སྟོན་ཏོ། །
en: “What was predicted is the knowledge that comes from the understanding of what cannot be grasped by the mind.”

source: སྨྲས་པ་ཡེ་ཤེས་གང་ལུང་བསྟན།
en: “And is this knowledge produced by duality?”

source: སྨྲས་པ། གང་གཉིས་ཀྱིས་རབ་ཏུ་མ་ཕྱི་བའོ། །སྨྲས་པ། གལ་ཏེ་གཉིས་ཀྱིས་རབ་ཏུ་ཕྱེ་བར་གྱུར་ན། ལུང་བསྟན་པ་ཐོབ་པར་མི་འགྱུར་ཏེ།
en: “If it were produced by duality,” Vajrapāṇi responded, “then one could not obtain a prediction.

source: གང་གི་ཕྱིར་ཡེ་ཤེས་གཉིས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་པ་དེའི་ཕྱིར་གཉིས་སུ་མེད་པའི་ལུང་བསྟན་པ་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་ལུང་བསྟན་པའོ། །
en: Since knowledge is not produced by duality, the predictions bodhisattvas obtain are only nondual predictions.”

source: སྨྲས་པ། གལ་ཏེ་ཡེ་ཤེས་གཉིས་སུ་མེད་པས་རབ་ཏུ་ཕྱེ་བ་ཡིན་ན། ལུང་སྟོན་པ་ནི་སུ་ཞིག །ལུང་ནི་སུ་ལ་སྟོན། སྨྲས་པ།
en: Śāntamati then asked, “If knowledge is produced by nonduality, then who gives the prediction and who receives the prediction?”

source: ལུང་སྟོན་པ་གང་ཡིན་པ་དང་སུ་ལ་ལུང་བསྟན་པ་དེ་དག་ནི་མཉམ་པ་ཉིད་དུ་གྱུར་པའོ། །
en: “The one who gives the prediction and the one who receives the prediction are obtained by understanding that they are same.

source: དེ་དག་ནི་གཉིས་སུ་མེད་པའི་མཐའ་ལ་གནས་པའོ། །སྨྲས་པ།
en: They are conceived from the position of nonduality.”

source: གསང་བ་པའི་བདག་པོ་གཉིས་སུ་མེད་པའི་མཐའ་གང་ཡིན་པ་དེ་ལ་ལུང་བསྟན་དུ་ཅི་ཡོད། སྨྲས་པ།
en: “For one who has the position of nonduality, Lord of the Guhyakas, what prediction can there be?”

source: མཐའ་གང་ཡིན་པ་དེ་ཉིད་གཉིས་སུ་མེད་པའི་མཐའ་སྟེ་མཐའ་དེ་ཉིད་ལུང་བསྟན་པའོ། །
en: “For whichever position one has, that position being the position of nonduality, there is a prediction precisely for the one who has that position.”

source: སྨྲས་པ། གང་ལ་གནས་ན་ལུང་བསྟན་པ་ཐོབ་པའི་མཐའ་གང་ཡིན། སྨྲས་པ།
en: “For which position is there a prediction for the one who stands thereon?”

source: བདག་གི་མཐའ་ལ་གནས་ན་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “For one who stands on the position that there is a self, there is a prediction.

source: སེམས་ཅན་གྱི་མཐའ་དང་། སྲོག་དང་། གང་ཟག་གི་མཐའ་ལ་གནས་ན། ལུང་བསྟན་པར་འགྱུར་རོ། །
en: For one who stands on the position that there is a being, there is a prediction, as well as for one who stands on the position that there is a life force or a person.”

source: བདག་གི་མཐའི་གནས་གང་གི་གནས་ཡིན། སྨྲས་པ།
en: “On what is one standing when one is standing on the position that there is a self?”

source: བདག་གི་མཐའི་གནས་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བའི་མཐའི་གནས་སོ། །
en: “When one is standing on the position that there is a self, one is standing on the position of being liberated by the realized ones.”

source: སྨྲས་པ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བའི་མཐའ་གང་གི་གནས་ཡིན། སྨྲས་པ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བའི་མཐའི་གནས་ནི་མ་རིག་པ་དང་།
en: “What is standing on the position of being liberated by the realized ones?”

source: སྲིད་པའི་སྲེད་པའི་མཐའི་གནས་སོ། །
en: “It is standing on the position of craving, becoming, and ignorance.”

source: སྨྲས་པ། མ་རིག་པ་དང་། སྲིད་པའི་སྲེད་པའི་མཐའི་གནས་གང་གི་གནས་ཡིན། སྨྲས་པ།
en: Śāntamati asked, “On what is one standing when one is standing on the position of craving, becoming, and ignorance?”

source: ཤིན་ཏུ་མ་སྐྱེས་མ་བྱུང་བའི་མཐའི་གནས་སོ། །
en: “One is standing on the position of what is perpetually not born and not produced,” said Vajrapāṇi.

source: སྨྲས་པ། མ་སྐྱེས་པ་དང་མ་བྱུང་བའི་གནས་གང་ཡིན།
en: “Standing on what is not born is what kind of stance?”

source: སྨྲས་པ། རྣམ་པར་རིག་པ་མ་ཡིན་པའི་མཐའ་ནི་གནས་སོ། །
en: “It is a stance that makes something known.”

source: སྨྲས་པ། རྣམ་པར་རིག་པས་ཅི་ཞིག་རིག་པར་བྱེད།
en: “What is made known by making something known?

source: སྨྲས་པ། གལ་ཏེ་རྣམ་པར་རིག་པར་བྱེད་ན། རྣམ་པར་རིག་པ་མ་ཡིན་པར་མི་འགྱུར་རོ། །
en: “If one is making something known, it would not be something unknown.”

source: སྨྲས་པ། ཅི་ཞིག་རྣམ་པར་རིག་པར་མི་བྱེད།
en: “What is not made known?”

source: སྨྲས་པ། རྣམ་པར་རིག་པ་ཐམས་ཅད་རྣམ་པར་རིག་པར་མི་བྱེད་དོ། །
en: “All that is made known does not make it known.”

source: སྨྲས་པ། གལ་ཏེ་རྣམ་པར་རིག་པར་མི་བྱེད་ན་ཇི་ལྟར་ཀུན་ཤེས་པར་བྱེད། སྨྲས་པ།
en: “If it is not made known, then how does one give an instruction?”

source: གལ་ཏེ་ཀུན་ཤེས་པར་བྱེད་ན་རྣམ་པར་རིག་པར་བྱེད་པ་མ་ཡིན་ཏེ།
en: “If one were to give an instruction, one would not make something known.

source: གང་གི་ཕྱིར་རྣམ་པར་རིག་པར་མི་བྱེད་པ་དེའི་ཕྱིར་ཀུན་ཤེས་པར་བྱེད་དོ། །སྨྲས་པ།
en: Since one does not make something known, therefore one gives an instruction.”

source: ཀུན་ཤེས་པར་བྱེད་པ་ཇི་ལྟ་བུ་ཡིན། སྨྲས་པ།
en: “How is one instructed?”

source: གང་གི་ཚེ་རྣམ་པར་རིག་པ་ཁས་མི་ལེན་པའོ། །
en: “When one does not receive information.”

source: སྨྲས་པ། ཇི་ལྟར་ན་རྣམ་པར་རིག་པ་ཁས་མི་ལེན།
en: “How does one not receive information?”

source: སྨྲས་པ། གང་གི་ཚེ་ཚིག་འབྲུའི་རྗེས་སུ་མི་རྒྱུག་པའོ། །
en: “When one does not chase after words.”

source: སྨྲས་པ། ཇི་ལྟར་ན་ཚིག་འབྲུའི་རྗེས་སུ་མི་རྒྱུག །
en: “How does one not chase after words?”

source: སྨྲས་པ་གང་གི་ཚེ་དོན་ལ་རྟོན་པའོ། །
en: “When one relies on the meaning.”

source: སྨྲས་པ། དོན་ལ་རྟོན་པ་ཇི་ལྟ་བུ་ཡིན།
en: “How does one rely on the meaning?”

source: སྨྲས་པ། གང་གི་ཚེ་དོན་མི་མཐོང་བའོ། །
en: “When one does not see the meaning.”

source: སྨྲས་པ། དོན་མི་མཐོང་བ་ཇི་ལྟ་བུ་ཡིན།
en: “How does one not see the meaning?”

source: སྨྲས་པ། གང་གི་ཚེ་དོན་དང་དོན་མ་ཡིན་པ་དོན་དུ་མི་གཉེར་བའོ། །
en: “When one is not intent on meaning or lack of meaning.”

source: སྨྲས་པ། གང་གི་ཚེ་དོན་དང་དོན་མ་ཡིན་པ་དོན་དུ་མི་གཉེར་བར་གྱུར་པ་དེའི་ཚེ་ཅི་ཞིག་དོན་དུ་གཉེར་བར་འགྱུར།
en: “When one is not intent on meaning or lack of meaning, then does one lack intent?”

source: སྨྲས་པ། གང་གི་ཚེ་དོན་དང་དོན་མ་ཡིན་པ་དོན་དུ་མི་གཉེར་བར་གྱུར་པ་དེའི་ཚེ་ཆོས་དོན་དུ་གཉེར་བར་འགྱུར་རོ། །
en: “When one is not intent on meaning or lack of meaning, then one is intent on the Dharma.”

source: སྨྲས་པ། གལ་ཏེ་ཆོས་དོན་དུ་གཉེར་བར་གྱུར་ན་དེ་དོན་དུ་གཉེར་བ་ཉིད་མ་ཡིན་ནམ། སྨྲས་པ།
en: “If one is intent on the Dharma, is that not simply being intent on something?”

source: རིགས་ཀྱི་བུ་ཆོས་དོན་དུ་གཉེར་བ་ནི་ཅི་ཡང་དོན་དུ་གཉེར་བ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་གིས་གང་དོན་དུ་གཉེར་བ་དེ་ནི་ཆོས་མ་ཡིན་ཏེ་ནི་ཆོས་སུ་མི་རུང་ངོ་། །སྨྲས་པ།
en: “One who is intent on the Dharma, noble son, is not intent on anything at all, because the thing on which such a being is intent is not a thing, nor is the one who is intent upon it a thing, either.”

source: ཆོས་གང་ཡིན། སྨྲས་པ།
en: “What, again, is not a thing?”

source: གང་ལ་ཆོས་ཀྱི་སྒྲ་ཡང་མི་དམིགས་པའོ། །
en: “Where not even the word thing obtains.”

source: སྨྲས་པ། གང་ལ་ཆོས་ཀྱི་སྒྲ་ཡང་མི་དམིགས་པ་དེ་ལ་ཆོས་གང་ཡིན།
en: “Where not even the word thing obtains, what sort of Dharma can there be?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་གང་ལ་ཡི་གེ་རྣམས་ཀུན་ཏུ་མི་འབྱུང་བ་དེ་ཉིད་ཆོས་ཡིན་ནོ། །དེ་བས་ན་ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་པ།
en: “It is precisely the Dharma, noble son, to which words do not speak, because, as it is said, all things are inexpressible;

source: སྒྲ་མེད་པ་བརྗོད་པ་མེད་པའོ། །
en: they cannot be given voice, they cannot be put into words.

source: རིགས་ཀྱི་བུ་སུ་ཞིག་བདག་སྨྲའོ་ཞེས་སྨྲ་བ་དེ་འཆལ་པར་སྨྲ་བའོ། །གང་འཆལ་པར་སྨྲ་བ་དེ་ལ་ཆོས་མེད་དོ། །འདུལ་བ་མེད་དོ། །
en: Noble son, when one speaks the words ‘I speak,’ one misspeaks, and one who misspeaks possesses neither the Dharma nor the Discipline.”
